AR-Scorpii/AGLD-APS/inc/stc8h_xfr.h
/**
 * @file        stc8h_cfr.h
 * 
 * @brief       The external special function register (XSFR or XFR) 
 *              definitions for STC8H series microcontroller. 
 * 
 * @copyright   This is modified from STC official codes. The copyright belongs
 *              to STC. 
 */

#ifndef     __STC8H_XFR_H__
#define     __STC8H_XFR_H__

#include "stc8h_sfr.h"

// to access xfrs, must write 1 to bit 7 of P_SW2
// or it will operate xram
#define	EAXSFR()		P_SW2 |= 0x80
#define	EAXRAM()		P_SW2 &= ~0x80

/////////////////////////////////////////////////
//FF00H-FFFFH
/////////////////////////////////////////////////

/////////////////////////////////////////////////
//FE00H-FEFFH
/////////////////////////////////////////////////

#define     CLKSEL          (*(unsigned char volatile xdata *)0xfe00)
#define     CLKDIV          (*(unsigned char volatile xdata *)0xfe01)
#define     HIRCCR          (*(unsigned char volatile xdata *)0xfe02)
#define     XOSCCR          (*(unsigned char volatile xdata *)0xfe03)
#define     IRC32KCR        (*(unsigned char volatile xdata *)0xfe04)
#define     MCLKOCR         (*(unsigned char volatile xdata *)0xfe05)
#define     IRCDB           (*(unsigned char volatile xdata *)0xfe06)
#define     IRC48MCR        (*(unsigned char volatile xdata *)0xfe07)
#define     X32KCR          (*(unsigned char volatile xdata *)0xfe08)

#define     P0PU            (*(unsigned char volatile xdata *)0xfe10)
#define     P1PU            (*(unsigned char volatile xdata *)0xfe11)
#define     P2PU            (*(unsigned char volatile xdata *)0xfe12)
#define     P3PU            (*(unsigned char volatile xdata *)0xfe13)
#define     P4PU            (*(unsigned char volatile xdata *)0xfe14)
#define     P5PU            (*(unsigned char volatile xdata *)0xfe15)
#define     P6PU            (*(unsigned char volatile xdata *)0xfe16)
#define     P7PU            (*(unsigned char volatile xdata *)0xfe17)
#define     P0NCS           (*(unsigned char volatile xdata *)0xfe18)
#define     P1NCS           (*(unsigned char volatile xdata *)0xfe19)
#define     P2NCS           (*(unsigned char volatile xdata *)0xfe1a)
#define     P3NCS           (*(unsigned char volatile xdata *)0xfe1b)
#define     P4NCS           (*(unsigned char volatile xdata *)0xfe1c)
#define     P5NCS           (*(unsigned char volatile xdata *)0xfe1d)
#define     P6NCS           (*(unsigned char volatile xdata *)0xfe1e)
#define     P7NCS           (*(unsigned char volatile xdata *)0xfe1f)
#define     P0SR            (*(unsigned char volatile xdata *)0xfe20)
#define     P1SR            (*(unsigned char volatile xdata *)0xfe21)
#define     P2SR            (*(unsigned char volatile xdata *)0xfe22)
#define     P3SR            (*(unsigned char volatile xdata *)0xfe23)
#define     P4SR            (*(unsigned char volatile xdata *)0xfe24)
#define     P5SR            (*(unsigned char volatile xdata *)0xfe25)
#define     P6SR            (*(unsigned char volatile xdata *)0xfe26)
#define     P7SR            (*(unsigned char volatile xdata *)0xfe27)
#define     P0DR            (*(unsigned char volatile xdata *)0xfe28)
#define     P1DR            (*(unsigned char volatile xdata *)0xfe29)
#define     P2DR            (*(unsigned char volatile xdata *)0xfe2a)
#define     P3DR            (*(unsigned char volatile xdata *)0xfe2b)
#define     P4DR            (*(unsigned char volatile xdata *)0xfe2c)
#define     P5DR            (*(unsigned char volatile xdata *)0xfe2d)
#define     P6DR            (*(unsigned char volatile xdata *)0xfe2e)
#define     P7DR            (*(unsigned char volatile xdata *)0xfe2f)
#define     P0IE            (*(unsigned char volatile xdata *)0xfe30)
#define     P1IE            (*(unsigned char volatile xdata *)0xfe31)
#define     P2IE            (*(unsigned char volatile xdata *)0xfe32)
#define     P3IE            (*(unsigned char volatile xdata *)0xfe33)
#define     P4IE            (*(unsigned char volatile xdata *)0xfe34)
#define     P5IE            (*(unsigned char volatile xdata *)0xfe35)
#define     P6IE            (*(unsigned char volatile xdata *)0xfe36)
#define     P7IE            (*(unsigned char volatile xdata *)0xfe37)

#define     LCMIFCFG        (*(unsigned char volatile xdata *)0xfe50)
#define     LCMIFCFG2       (*(unsigned char volatile xdata *)0xfe51)
#define     LCMIFCR         (*(unsigned char volatile xdata *)0xfe52)
#define     LCMIFSTA        (*(unsigned char volatile xdata *)0xfe53)
#define     LCMIFDATL       (*(unsigned char volatile xdata *)0xfe54)
#define     LCMIFDATH       (*(unsigned char volatile xdata *)0xfe55)

#define     RTCCR           (*(unsigned char volatile xdata *)0xfe60)
#define     RTCCFG          (*(unsigned char volatile xdata *)0xfe61)
#define     RTCIEN          (*(unsigned char volatile xdata *)0xfe62)
#define     RTCIF           (*(unsigned char volatile xdata *)0xfe63)
#define     ALAHOUR         (*(unsigned char volatile xdata *)0xfe64)
#define     ALAMIN          (*(unsigned char volatile xdata *)0xfe65)
#define     ALASEC          (*(unsigned char volatile xdata *)0xfe66)
#define     ALASSEC         (*(unsigned char volatile xdata *)0xfe67)
#define     INIYEAR         (*(unsigned char volatile xdata *)0xfe68)
#define     INIMONTH        (*(unsigned char volatile xdata *)0xfe69)
#define     INIDAY          (*(unsigned char volatile xdata *)0xfe6a)
#define     INIHOUR         (*(unsigned char volatile xdata *)0xfe6b)
#define     INIMIN          (*(unsigned char volatile xdata *)0xfe6c)
#define     INISEC          (*(unsigned char volatile xdata *)0xfe6d)
#define     INISSEC         (*(unsigned char volatile xdata *)0xfe6e)
#define     YEAR            (*(unsigned char volatile xdata *)0xfe70)
#define     MONTH           (*(unsigned char volatile xdata *)0xfe71)
#define     DAY             (*(unsigned char volatile xdata *)0xfe72)
#define     HOUR            (*(unsigned char volatile xdata *)0xfe73)
#define     MIN             (*(unsigned char volatile xdata *)0xfe74)
#define     SEC             (*(unsigned char volatile xdata *)0xfe75)
#define     SSEC            (*(unsigned char volatile xdata *)0xfe76)

#define     I2CCFG          (*(unsigned char volatile xdata *)0xfe80)
#define     I2CMSCR         (*(unsigned char volatile xdata *)0xfe81)
#define     I2CMSST         (*(unsigned char volatile xdata *)0xfe82)
#define     I2CSLCR         (*(unsigned char volatile xdata *)0xfe83)
#define     I2CSLST         (*(unsigned char volatile xdata *)0xfe84)
#define     I2CSLADR        (*(unsigned char volatile xdata *)0xfe85)
#define     I2CTXD          (*(unsigned char volatile xdata *)0xfe86)
#define     I2CRXD          (*(unsigned char volatile xdata *)0xfe87)
#define     I2CMSAUX        (*(unsigned char volatile xdata *)0xfe88)

#define     SPFUNC          (*(unsigned char volatile xdata *)0xfe98)
#define     RSTFLAG         (*(unsigned char volatile xdata *)0xfe99)

#define     TM2PS           (*(unsigned char volatile xdata *)0xfea2)
#define     TM3PS           (*(unsigned char volatile xdata *)0xfea3)
#define     TM4PS           (*(unsigned char volatile xdata *)0xfea4)
#define     ADCTIM          (*(unsigned char volatile xdata *)0xfea8)
#define     T3T4PIN         (*(unsigned char volatile xdata *)0xfeac)
#define     ADCEXCFG        (*(unsigned char volatile xdata *)0xfead)
#define     CMPEXCFG        (*(unsigned char volatile xdata *)0xfeae)

