AR-Scorpii/AGLD-APS/inc/stc8h_xfr.h
#define     PWMA_ETRPS      (*(unsigned char volatile xdata *)0xfeb0)
#define     PWMA_ENO        (*(unsigned char volatile xdata *)0xfeb1)
#define     PWMA_PS         (*(unsigned char volatile xdata *)0xfeb2)
#define     PWMA_IOAUX      (*(unsigned char volatile xdata *)0xfeb3)
#define     PWMB_ETRPS      (*(unsigned char volatile xdata *)0xfeb4)
#define     PWMB_ENO        (*(unsigned char volatile xdata *)0xfeb5)
#define     PWMB_PS         (*(unsigned char volatile xdata *)0xfeb6)
#define     PWMB_IOAUX      (*(unsigned char volatile xdata *)0xfeb7)

#define     PWMA_CR2        (*(unsigned char volatile xdata *)0xfec1)
#define     PWMA_CR1        (*(unsigned char volatile xdata *)0xfec0)
#define     PWMA_SMCR       (*(unsigned char volatile xdata *)0xfec2)
#define     PWMA_ETR        (*(unsigned char volatile xdata *)0xfec3)
#define     PWMA_IER        (*(unsigned char volatile xdata *)0xfec4)
#define     PWMA_SR1        (*(unsigned char volatile xdata *)0xfec5)
#define     PWMA_SR2        (*(unsigned char volatile xdata *)0xfec6)
#define     PWMA_EGR        (*(unsigned char volatile xdata *)0xfec7)
#define     PWMA_CCMR1      (*(unsigned char volatile xdata *)0xfec8)
#define     PWMA_CCMR2      (*(unsigned char volatile xdata *)0xfec9)
#define     PWMA_CCMR3      (*(unsigned char volatile xdata *)0xfeca)
#define     PWMA_CCMR4      (*(unsigned char volatile xdata *)0xfecb)
#define     PWMA_CCER1      (*(unsigned char volatile xdata *)0xfecc)
#define     PWMA_CCER2      (*(unsigned char volatile xdata *)0xfecd)
#define     PWMA_CNTR       (*(unsigned  int volatile xdata *)0xfece)
#define     PWMA_CNTRH      (*(unsigned char volatile xdata *)0xfece)
#define     PWMA_CNTRL      (*(unsigned char volatile xdata *)0xfecf)
#define     PWMA_PSCR       (*(unsigned  int volatile xdata *)0xfed0)
#define     PWMA_PSCRH      (*(unsigned char volatile xdata *)0xfed0)
#define     PWMA_PSCRL      (*(unsigned char volatile xdata *)0xfed1)
#define     PWMA_ARR        (*(unsigned  int volatile xdata *)0xfed2)
#define     PWMA_ARRH       (*(unsigned char volatile xdata *)0xfed2)
#define     PWMA_ARRL       (*(unsigned char volatile xdata *)0xfed3)
#define     PWMA_RCR        (*(unsigned char volatile xdata *)0xfed4)
#define     PWMA_CCR1       (*(unsigned  int volatile xdata *)0xfed5)
#define     PWMA_CCR1H      (*(unsigned char volatile xdata *)0xfed5)
#define     PWMA_CCR1L      (*(unsigned char volatile xdata *)0xfed6)
#define     PWMA_CCR2       (*(unsigned  int volatile xdata *)0xfed7)
#define     PWMA_CCR2H      (*(unsigned char volatile xdata *)0xfed7)
#define     PWMA_CCR2L      (*(unsigned char volatile xdata *)0xfed8)
#define     PWMA_CCR3       (*(unsigned  int volatile xdata *)0xfed9)
#define     PWMA_CCR3H      (*(unsigned char volatile xdata *)0xfed9)
#define     PWMA_CCR3L      (*(unsigned char volatile xdata *)0xfeda)
#define     PWMA_CCR4       (*(unsigned  int volatile xdata *)0xfedb)
#define     PWMA_CCR4H      (*(unsigned char volatile xdata *)0xfedb)
#define     PWMA_CCR4L      (*(unsigned char volatile xdata *)0xfedc)
#define     PWMA_BKR        (*(unsigned char volatile xdata *)0xfedd)
#define     PWMA_DTR        (*(unsigned char volatile xdata *)0xfede)
#define     PWMA_OISR       (*(unsigned char volatile xdata *)0xfedf)

#define     PWMB_CR1        (*(unsigned char volatile xdata *)0xfee0)
#define     PWMB_CR2        (*(unsigned char volatile xdata *)0xfee1)
#define     PWMB_SMCR       (*(unsigned char volatile xdata *)0xfee2)
#define     PWMB_ETR        (*(unsigned char volatile xdata *)0xfee3)
#define     PWMB_IER        (*(unsigned char volatile xdata *)0xfee4)
#define     PWMB_SR1        (*(unsigned char volatile xdata *)0xfee5)
#define     PWMB_SR2        (*(unsigned char volatile xdata *)0xfee6)
#define     PWMB_EGR        (*(unsigned char volatile xdata *)0xfee7)
#define     PWMB_CCMR1      (*(unsigned char volatile xdata *)0xfee8)
#define     PWMB_CCMR2      (*(unsigned char volatile xdata *)0xfee9)
#define     PWMB_CCMR3      (*(unsigned char volatile xdata *)0xfeea)
#define     PWMB_CCMR4      (*(unsigned char volatile xdata *)0xfeeb)
#define     PWMB_CCER1      (*(unsigned char volatile xdata *)0xfeec)
#define     PWMB_CCER2      (*(unsigned char volatile xdata *)0xfeed)
#define     PWMB_CNTR       (*(unsigned  int volatile xdata *)0xfeee)
#define     PWMB_CNTRH      (*(unsigned char volatile xdata *)0xfeee)
#define     PWMB_CNTRL      (*(unsigned char volatile xdata *)0xfeef)
#define     PWMB_PSCR       (*(unsigned  int volatile xdata *)0xfef0)
#define     PWMB_PSCRH      (*(unsigned char volatile xdata *)0xfef0)
#define     PWMB_PSCRL      (*(unsigned char volatile xdata *)0xfef1)
#define     PWMB_ARR        (*(unsigned  int volatile xdata *)0xfef2)
#define     PWMB_ARRH       (*(unsigned char volatile xdata *)0xfef2)
#define     PWMB_ARRL       (*(unsigned char volatile xdata *)0xfef3)
#define     PWMB_RCR        (*(unsigned char volatile xdata *)0xfef4)
#define     PWMB_CCR5       (*(unsigned  int volatile xdata *)0xfef5)
#define     PWMB_CCR5H      (*(unsigned char volatile xdata *)0xfef5)
#define     PWMB_CCR5L      (*(unsigned char volatile xdata *)0xfef6)
#define     PWMB_CCR6       (*(unsigned  int volatile xdata *)0xfef7)
#define     PWMB_CCR6H      (*(unsigned char volatile xdata *)0xfef7)
#define     PWMB_CCR6L      (*(unsigned char volatile xdata *)0xfef8)
#define     PWMB_CCR7       (*(unsigned  int volatile xdata *)0xfef9)
#define     PWMB_CCR7H      (*(unsigned char volatile xdata *)0xfef9)
#define     PWMB_CCR7L      (*(unsigned char volatile xdata *)0xfefa)
#define     PWMB_CCR8       (*(unsigned  int volatile xdata *)0xfefb)
#define     PWMB_CCR8H      (*(unsigned char volatile xdata *)0xfefb)
#define     PWMB_CCR8L      (*(unsigned char volatile xdata *)0xfefc)
#define     PWMB_BKR        (*(unsigned char volatile xdata *)0xfefd)
#define     PWMB_DTR        (*(unsigned char volatile xdata *)0xfefe)
#define     PWMB_OISR       (*(unsigned char volatile xdata *)0xfeff)

/////////////////////////////////////////////////
//FD00H-FDFFH
/////////////////////////////////////////////////

#define     P0INTE          (*(unsigned char volatile xdata *)0xfd00)
#define     P1INTE          (*(unsigned char volatile xdata *)0xfd01)
#define     P2INTE          (*(unsigned char volatile xdata *)0xfd02)
#define     P3INTE          (*(unsigned char volatile xdata *)0xfd03)
#define     P4INTE          (*(unsigned char volatile xdata *)0xfd04)
#define     P5INTE          (*(unsigned char volatile xdata *)0xfd05)
#define     P6INTE          (*(unsigned char volatile xdata *)0xfd06)
#define     P7INTE          (*(unsigned char volatile xdata *)0xfd07)
#define     P0INTF          (*(unsigned char volatile xdata *)0xfd10)
#define     P1INTF          (*(unsigned char volatile xdata *)0xfd11)
#define     P2INTF          (*(unsigned char volatile xdata *)0xfd12)
#define     P3INTF          (*(unsigned char volatile xdata *)0xfd13)
#define     P4INTF          (*(unsigned char volatile xdata *)0xfd14)
#define     P5INTF          (*(unsigned char volatile xdata *)0xfd15)
#define     P6INTF          (*(unsigned char volatile xdata *)0xfd16)
#define     P7INTF          (*(unsigned char volatile xdata *)0xfd17)
#define     P0IM0           (*(unsigned char volatile xdata *)0xfd20)
#define     P1IM0           (*(unsigned char volatile xdata *)0xfd21)
#define     P2IM0           (*(unsigned char volatile xdata *)0xfd22)
#define     P3IM0           (*(unsigned char volatile xdata *)0xfd23)
#define     P4IM0           (*(unsigned char volatile xdata *)0xfd24)
#define     P5IM0           (*(unsigned char volatile xdata *)0xfd25)
#define     P6IM0           (*(unsigned char volatile xdata *)0xfd26)
#define     P7IM0           (*(unsigned char volatile xdata *)0xfd27)
#define     P0IM1           (*(unsigned char volatile xdata *)0xfd30)
#define     P1IM1           (*(unsigned char volatile xdata *)0xfd31)
#define     P2IM1           (*(unsigned char volatile xdata *)0xfd32)
#define     P3IM1           (*(unsigned char volatile xdata *)0xfd33)
#define     P4IM1           (*(unsigned char volatile xdata *)0xfd34)
#define     P5IM1           (*(unsigned char volatile xdata *)0xfd35)
#define     P6IM1           (*(unsigned char volatile xdata *)0xfd36)
#define     P7IM1           (*(unsigned char volatile xdata *)0xfd37)
#define     P0WKUE          (*(unsigned char volatile xdata *)0xfd40)
#define     P1WKUE          (*(unsigned char volatile xdata *)0xfd41)
#define     P2WKUE          (*(unsigned char volatile xdata *)0xfd42)
#define     P3WKUE          (*(unsigned char volatile xdata *)0xfd43)
#define     P4WKUE          (*(unsigned char volatile xdata *)0xfd44)
#define     P5WKUE          (*(unsigned char volatile xdata *)0xfd45)
#define     P6WKUE          (*(unsigned char volatile xdata *)0xfd46)
#define     P7WKUE          (*(unsigned char volatile xdata *)0xfd47)

#define     PIN_IP          (*(unsigned char volatile xdata *)0xfd60)
#define     PIN_IPH         (*(unsigned char volatile xdata *)0xfd61)

