AR-Scorpii/AGLD-APS/inc/stc8h_xfr.h
#define     CHIPID          ( (unsigned char volatile xdata *)0xfde0)

#define     CHIPID0         (*(unsigned char volatile xdata *)0xfde0)
#define     CHIPID1         (*(unsigned char volatile xdata *)0xfde1)
#define     CHIPID2         (*(unsigned char volatile xdata *)0xfde2)
#define     CHIPID3         (*(unsigned char volatile xdata *)0xfde3)
#define     CHIPID4         (*(unsigned char volatile xdata *)0xfde4)
#define     CHIPID5         (*(unsigned char volatile xdata *)0xfde5)
#define     CHIPID6         (*(unsigned char volatile xdata *)0xfde6)
#define     CHIPID7         (*(unsigned char volatile xdata *)0xfde7)
#define     CHIPID8         (*(unsigned char volatile xdata *)0xfde8)
#define     CHIPID9         (*(unsigned char volatile xdata *)0xfde9)
#define     CHIPID10        (*(unsigned char volatile xdata *)0xfdea)
#define     CHIPID11        (*(unsigned char volatile xdata *)0xfdeb)
#define     CHIPID12        (*(unsigned char volatile xdata *)0xfdec)
#define     CHIPID13        (*(unsigned char volatile xdata *)0xfded)
#define     CHIPID14        (*(unsigned char volatile xdata *)0xfdee)
#define     CHIPID15        (*(unsigned char volatile xdata *)0xfdef)
#define     CHIPID16        (*(unsigned char volatile xdata *)0xfdf0)
#define     CHIPID17        (*(unsigned char volatile xdata *)0xfdf1)
#define     CHIPID18        (*(unsigned char volatile xdata *)0xfdf2)
#define     CHIPID19        (*(unsigned char volatile xdata *)0xfdf3)
#define     CHIPID20        (*(unsigned char volatile xdata *)0xfdf4)
#define     CHIPID21        (*(unsigned char volatile xdata *)0xfdf5)
#define     CHIPID22        (*(unsigned char volatile xdata *)0xfdf6)
#define     CHIPID23        (*(unsigned char volatile xdata *)0xfdf7)
#define     CHIPID24        (*(unsigned char volatile xdata *)0xfdf8)
#define     CHIPID25        (*(unsigned char volatile xdata *)0xfdf9)
#define     CHIPID26        (*(unsigned char volatile xdata *)0xfdfa)
#define     CHIPID27        (*(unsigned char volatile xdata *)0xfdfb)
#define     CHIPID28        (*(unsigned char volatile xdata *)0xfdfc)
#define     CHIPID29        (*(unsigned char volatile xdata *)0xfdfd)
#define     CHIPID30        (*(unsigned char volatile xdata *)0xfdfe)
#define     CHIPID31        (*(unsigned char volatile xdata *)0xfdff)

/////////////////////////////////////////////////
//FC00H-FCFFH
/////////////////////////////////////////////////

#define     MD3             (*(unsigned char volatile xdata *)0xfcf0)
#define     MD2             (*(unsigned char volatile xdata *)0xfcf1)
#define     MD1             (*(unsigned char volatile xdata *)0xfcf2)
#define     MD0             (*(unsigned char volatile xdata *)0xfcf3)
#define     MD5             (*(unsigned char volatile xdata *)0xfcf4)
#define     MD4             (*(unsigned char volatile xdata *)0xfcf5)
#define     ARCON           (*(unsigned char volatile xdata *)0xfcf6)
#define     OPCON           (*(unsigned char volatile xdata *)0xfcf7)

/////////////////////////////////////////////////
//FB00H-FBFFH
/////////////////////////////////////////////////

#define     COMEN           (*(unsigned char volatile xdata *)0xfb00)
#define     SEGENL          (*(unsigned char volatile xdata *)0xfb01)
#define     SEGENH          (*(unsigned char volatile xdata *)0xfb02)
#define     LEDCTRL         (*(unsigned char volatile xdata *)0xfb03)
#define     LEDCKS          (*(unsigned char volatile xdata *)0xfb04)
#define     COM0_DA_L       (*(unsigned char volatile xdata *)0xfb10)
#define     COM1_DA_L       (*(unsigned char volatile xdata *)0xfb11)
#define     COM2_DA_L       (*(unsigned char volatile xdata *)0xfb12)
#define     COM3_DA_L       (*(unsigned char volatile xdata *)0xfb13)
#define     COM4_DA_L       (*(unsigned char volatile xdata *)0xfb14)
#define     COM5_DA_L       (*(unsigned char volatile xdata *)0xfb15)
#define     COM6_DA_L       (*(unsigned char volatile xdata *)0xfb16)
#define     COM7_DA_L       (*(unsigned char volatile xdata *)0xfb17)
#define     COM0_DA_H       (*(unsigned char volatile xdata *)0xfb18)
#define     COM1_DA_H       (*(unsigned char volatile xdata *)0xfb19)
#define     COM2_DA_H       (*(unsigned char volatile xdata *)0xfb1a)
#define     COM3_DA_H       (*(unsigned char volatile xdata *)0xfb1b)
#define     COM4_DA_H       (*(unsigned char volatile xdata *)0xfb1c)
#define     COM5_DA_H       (*(unsigned char volatile xdata *)0xfb1d)
#define     COM6_DA_H       (*(unsigned char volatile xdata *)0xfb1e)
#define     COM7_DA_H       (*(unsigned char volatile xdata *)0xfb1f)
#define     COM0_DC_L       (*(unsigned char volatile xdata *)0xfb20)
#define     COM1_DC_L       (*(unsigned char volatile xdata *)0xfb21)
#define     COM2_DC_L       (*(unsigned char volatile xdata *)0xfb22)
#define     COM3_DC_L       (*(unsigned char volatile xdata *)0xfb23)
#define     COM4_DC_L       (*(unsigned char volatile xdata *)0xfb24)
#define     COM5_DC_L       (*(unsigned char volatile xdata *)0xfb25)
#define     COM6_DC_L       (*(unsigned char volatile xdata *)0xfb26)
#define     COM7_DC_L       (*(unsigned char volatile xdata *)0xfb27)
#define     COM0_DC_H       (*(unsigned char volatile xdata *)0xfb28)
#define     COM1_DC_H       (*(unsigned char volatile xdata *)0xfb29)
#define     COM2_DC_H       (*(unsigned char volatile xdata *)0xfb2a)
#define     COM3_DC_H       (*(unsigned char volatile xdata *)0xfb2b)
#define     COM4_DC_H       (*(unsigned char volatile xdata *)0xfb2c)
#define     COM5_DC_H       (*(unsigned char volatile xdata *)0xfb2d)
#define     COM6_DC_H       (*(unsigned char volatile xdata *)0xfb2e)
#define     COM7_DC_H       (*(unsigned char volatile xdata *)0xfb2f)

#define     TSCHEN1         (*(unsigned char volatile xdata *)0xfb40)
#define     TSCHEN2         (*(unsigned char volatile xdata *)0xfb41)
#define     TSCFG1          (*(unsigned char volatile xdata *)0xfb42)
#define     TSCFG2          (*(unsigned char volatile xdata *)0xfb43)
#define     TSWUTC          (*(unsigned char volatile xdata *)0xfb44)
#define     TSCTRL          (*(unsigned char volatile xdata *)0xfb45)
#define     TSSTA1          (*(unsigned char volatile xdata *)0xfb46)
#define     TSSTA2          (*(unsigned char volatile xdata *)0xfb47)
#define     TSRT            (*(unsigned char volatile xdata *)0xfb48)
#define     TSDAT           (*(unsigned int  volatile xdata *)0xfb49)
#define     TSDATH          (*(unsigned char volatile xdata *)0xfb49)
#define     TSDATL          (*(unsigned char volatile xdata *)0xfb4A)
#define     TSTH00          (*(unsigned int  volatile xdata *)0xfb50)
#define     TSTH00H         (*(unsigned char volatile xdata *)0xfb50)
#define     TSTH00L         (*(unsigned char volatile xdata *)0xfb51)
#define     TSTH01          (*(unsigned int  volatile xdata *)0xfb52)
#define     TSTH01H         (*(unsigned char volatile xdata *)0xfb52)
#define     TSTH01L         (*(unsigned char volatile xdata *)0xfb53)
#define     TSTH02          (*(unsigned int  volatile xdata *)0xfb54)
#define     TSTH02H         (*(unsigned char volatile xdata *)0xfb54)
#define     TSTH02L         (*(unsigned char volatile xdata *)0xfb55)
#define     TSTH03          (*(unsigned int  volatile xdata *)0xfb56)
#define     TSTH03H         (*(unsigned char volatile xdata *)0xfb56)
#define     TSTH03L         (*(unsigned char volatile xdata *)0xfb57)
#define     TSTH04          (*(unsigned int  volatile xdata *)0xfb58)
#define     TSTH04H         (*(unsigned char volatile xdata *)0xfb58)
#define     TSTH04L         (*(unsigned char volatile xdata *)0xfb59)
#define     TSTH05          (*(unsigned int  volatile xdata *)0xfb5a)
#define     TSTH05H         (*(unsigned char volatile xdata *)0xfb5a)
#define     TSTH05L         (*(unsigned char volatile xdata *)0xfb5b)
#define     TSTH06          (*(unsigned int  volatile xdata *)0xfb5c)
#define     TSTH06H         (*(unsigned char volatile xdata *)0xfb5c)
#define     TSTH06L         (*(unsigned char volatile xdata *)0xfb5d)
#define     TSTH07          (*(unsigned int  volatile xdata *)0xfb5e)
#define     TSTH07H         (*(unsigned char volatile xdata *)0xfb5e)
#define     TSTH07L         (*(unsigned char volatile xdata *)0xfb5f)
#define     TSTH08          (*(unsigned int  volatile xdata *)0xfb60)
#define     TSTH08H         (*(unsigned char volatile xdata *)0xfb60)
#define     TSTH08L         (*(unsigned char volatile xdata *)0xfb61)
#define     TSTH09          (*(unsigned int  volatile xdata *)0xfb62)
#define     TSTH09H         (*(unsigned char volatile xdata *)0xfb62)
#define     TSTH09L         (*(unsigned char volatile xdata *)0xfb63)
#define     TSTH10          (*(unsigned int  volatile xdata *)0xfb64)
#define     TSTH10H         (*(unsigned char volatile xdata *)0xfb64)
#define     TSTH10L         (*(unsigned char volatile xdata *)0xfb65)
#define     TSTH11          (*(unsigned int  volatile xdata *)0xfb66)
#define     TSTH11H         (*(unsigned char volatile xdata *)0xfb66)
#define     TSTH11L         (*(unsigned char volatile xdata *)0xfb67)
#define     TSTH12          (*(unsigned int  volatile xdata *)0xfb68)
#define     TSTH12H         (*(unsigned char volatile xdata *)0xfb68)
#define     TSTH12L         (*(unsigned char volatile xdata *)0xfb69)
#define     TSTH13          (*(unsigned int  volatile xdata *)0xfb6a)
#define     TSTH13H         (*(unsigned char volatile xdata *)0xfb6a)
#define     TSTH13L         (*(unsigned char volatile xdata *)0xfb6b)
#define     TSTH14          (*(unsigned int  volatile xdata *)0xfb6c)
#define     TSTH14H         (*(unsigned char volatile xdata *)0xfb6c)
#define     TSTH14L         (*(unsigned char volatile xdata *)0xfb6d)
#define     TSTH15          (*(unsigned int  volatile xdata *)0xfb6e)
#define     TSTH15H         (*(unsigned char volatile xdata *)0xfb6e)
#define     TSTH15L         (*(unsigned char volatile xdata *)0xfb6f)

#define     LCDCFG          (*(unsigned char volatile xdata *)0xfb80)
#define     LCDCFG2         (*(unsigned char volatile xdata *)0xfb81)
#define     DBLEN           (*(unsigned char volatile xdata *)0xfb82)
#define     COMLENL         (*(unsigned char volatile xdata *)0xfb83)
#define     COMLENM         (*(unsigned char volatile xdata *)0xfb84)
#define     COMLENH         (*(unsigned char volatile xdata *)0xfb85)
#define     BLINKRATE       (*(unsigned char volatile xdata *)0xfb86)
#define     LCDCR           (*(unsigned char volatile xdata *)0xfb87)
#define     COMON           (*(unsigned char volatile xdata *)0xfb88)
#define     SEGON1          (*(unsigned char volatile xdata *)0xfb8a)
#define     SEGON2          (*(unsigned char volatile xdata *)0xfb8b)
#define     SEGON3          (*(unsigned char volatile xdata *)0xfb8c)
#define     SEGON4          (*(unsigned char volatile xdata *)0xfb8d)
#define     SEGON5          (*(unsigned char volatile xdata *)0xfb8e)
#define     C0SEGV0         (*(unsigned char volatile xdata *)0xfb90)
#define     C0SEGV1         (*(unsigned char volatile xdata *)0xfb91)
#define     C0SEGV2         (*(unsigned char volatile xdata *)0xfb92)
#define     C0SEGV3         (*(unsigned char volatile xdata *)0xfb93)
#define     C0SEGV4         (*(unsigned char volatile xdata *)0xfb94)
#define     C1SEGV0         (*(unsigned char volatile xdata *)0xfb98)
#define     C1SEGV1         (*(unsigned char volatile xdata *)0xfb99)
#define     C1SEGV2         (*(unsigned char volatile xdata *)0xfb9a)
#define     C1SEGV3         (*(unsigned char volatile xdata *)0xfb9b)
#define     C1SEGV4         (*(unsigned char volatile xdata *)0xfb9c)
#define     C2SEGV0         (*(unsigned char volatile xdata *)0xfba0)
#define     C2SEGV1         (*(unsigned char volatile xdata *)0xfba1)
#define     C2SEGV2         (*(unsigned char volatile xdata *)0xfba2)
#define     C2SEGV3         (*(unsigned char volatile xdata *)0xfba3)
#define     C2SEGV4         (*(unsigned char volatile xdata *)0xfba4)
#define     C3SEGV0         (*(unsigned char volatile xdata *)0xfba8)
#define     C3SEGV1         (*(unsigned char volatile xdata *)0xfba9)
#define     C3SEGV2         (*(unsigned char volatile xdata *)0xfbaa)
#define     C3SEGV3         (*(unsigned char volatile xdata *)0xfbab)
#define     C3SEGV4         (*(unsigned char volatile xdata *)0xfbac)

/////////////////////////////////////////////////
//FA00H-FAFFH
/////////////////////////////////////////////////

#define     DMA_M2M_CFG     (*(unsigned char volatile xdata *)0xfa00)
#define     DMA_M2M_CR      (*(unsigned char volatile xdata *)0xfa01)
#define     DMA_M2M_STA     (*(unsigned char volatile xdata *)0xfa02)
#define     DMA_M2M_AMT     (*(unsigned char volatile xdata *)0xfa03)
#define     DMA_M2M_DONE    (*(unsigned char volatile xdata *)0xfa04)
#define     DMA_M2M_TXAH    (*(unsigned char volatile xdata *)0xfa05)
#define     DMA_M2M_TXAL    (*(unsigned char volatile xdata *)0xfa06)
#define     DMA_M2M_RXAH    (*(unsigned char volatile xdata *)0xfa07)
#define     DMA_M2M_RXAL    (*(unsigned char volatile xdata *)0xfa08)

#define     DMA_ADC_CFG     (*(unsigned char volatile xdata *)0xfa10)
#define     DMA_ADC_CR      (*(unsigned char volatile xdata *)0xfa11)
#define     DMA_ADC_STA     (*(unsigned char volatile xdata *)0xfa12)
#define     DMA_ADC_RXA     (*(unsigned  int volatile xdata *)0xfa17)
#define     DMA_ADC_RXAH    (*(unsigned char volatile xdata *)0xfa17)
#define     DMA_ADC_RXAL    (*(unsigned char volatile xdata *)0xfa18)
#define     DMA_ADC_CFG2    (*(unsigned char volatile xdata *)0xfa19)
#define     DMA_ADC_CHSW0   (*(unsigned char volatile xdata *)0xfa1a)
#define     DMA_ADC_CHSW1   (*(unsigned char volatile xdata *)0xfa1b)

#define     DMA_SPI_CFG     (*(unsigned char volatile xdata *)0xfa20)
#define     DMA_SPI_CR      (*(unsigned char volatile xdata *)0xfa21)
#define     DMA_SPI_STA     (*(unsigned char volatile xdata *)0xfa22)
#define     DMA_SPI_AMT     (*(unsigned char volatile xdata *)0xfa23)
#define     DMA_SPI_DONE    (*(unsigned char volatile xdata *)0xfa24)
#define     DMA_SPI_TXA     (*(unsigned  int volatile xdata *)0xfa25)
#define     DMA_SPI_TXAH    (*(unsigned char volatile xdata *)0xfa25)
#define     DMA_SPI_TXAL    (*(unsigned char volatile xdata *)0xfa26)
#define     DMA_SPI_RXA     (*(unsigned  int volatile xdata *)0xfa27)
#define     DMA_SPI_RXAH    (*(unsigned char volatile xdata *)0xfa27)
#define     DMA_SPI_RXAL    (*(unsigned char volatile xdata *)0xfa28)
#define     DMA_SPI_CFG2    (*(unsigned char volatile xdata *)0xfa29)

#define     DMA_UR1T_CFG    (*(unsigned char volatile xdata *)0xfa30)
#define     DMA_UR1T_CR     (*(unsigned char volatile xdata *)0xfa31)
#define     DMA_UR1T_STA    (*(unsigned char volatile xdata *)0xfa32)
#define     DMA_UR1T_AMT    (*(unsigned char volatile xdata *)0xfa33)
#define     DMA_UR1T_DONE   (*(unsigned char volatile xdata *)0xfa34)
#define     DMA_UR1T_TXA    (*(unsigned  int volatile xdata *)0xfa35)
#define     DMA_UR1T_TXAH   (*(unsigned char volatile xdata *)0xfa35)
#define     DMA_UR1T_TXAL   (*(unsigned char volatile xdata *)0xfa36)
#define     DMA_UR1R_CFG    (*(unsigned char volatile xdata *)0xfa38)
#define     DMA_UR1R_CR     (*(unsigned char volatile xdata *)0xfa39)
#define     DMA_UR1R_STA    (*(unsigned char volatile xdata *)0xfa3a)
#define     DMA_UR1R_AMT    (*(unsigned char volatile xdata *)0xfa3b)
#define     DMA_UR1R_DONE   (*(unsigned char volatile xdata *)0xfa3c)
#define     DMA_UR1R_RXA    (*(unsigned  int volatile xdata *)0xfa3d)
#define     DMA_UR1R_RXAH   (*(unsigned char volatile xdata *)0xfa3d)
#define     DMA_UR1R_RXAL   (*(unsigned char volatile xdata *)0xfa3e)

#define     DMA_UR2T_CFG    (*(unsigned char volatile xdata *)0xfa40)
#define     DMA_UR2T_CR     (*(unsigned char volatile xdata *)0xfa41)
#define     DMA_UR2T_STA    (*(unsigned char volatile xdata *)0xfa42)
#define     DMA_UR2T_AMT    (*(unsigned char volatile xdata *)0xfa43)
#define     DMA_UR2T_DONE   (*(unsigned char volatile xdata *)0xfa44)
#define     DMA_UR2T_TXA    (*(unsigned  int volatile xdata *)0xfa45)
#define     DMA_UR2T_TXAH   (*(unsigned char volatile xdata *)0xfa45)
#define     DMA_UR2T_TXAL   (*(unsigned char volatile xdata *)0xfa46)
#define     DMA_UR2R_CFG    (*(unsigned char volatile xdata *)0xfa48)
#define     DMA_UR2R_CR     (*(unsigned char volatile xdata *)0xfa49)
#define     DMA_UR2R_STA    (*(unsigned char volatile xdata *)0xfa4a)
#define     DMA_UR2R_AMT    (*(unsigned char volatile xdata *)0xfa4b)
#define     DMA_UR2R_DONE   (*(unsigned char volatile xdata *)0xfa4c)
#define     DMA_UR2R_RXA    (*(unsigned  int volatile xdata *)0xfa4d)
#define     DMA_UR2R_RXAH   (*(unsigned char volatile xdata *)0xfa4d)
#define     DMA_UR2R_RXAL   (*(unsigned char volatile xdata *)0xfa4e)

#define     DMA_UR3T_CFG    (*(unsigned char volatile xdata *)0xfa50)
#define     DMA_UR3T_CR     (*(unsigned char volatile xdata *)0xfa51)
#define     DMA_UR3T_STA    (*(unsigned char volatile xdata *)0xfa52)
#define     DMA_UR3T_AMT    (*(unsigned char volatile xdata *)0xfa53)
#define     DMA_UR3T_DONE   (*(unsigned char volatile xdata *)0xfa54)
#define     DMA_UR3T_TXA    (*(unsigned  int volatile xdata *)0xfa55)
#define     DMA_UR3T_TXAH   (*(unsigned char volatile xdata *)0xfa55)
#define     DMA_UR3T_TXAL   (*(unsigned char volatile xdata *)0xfa56)
#define     DMA_UR3R_CFG    (*(unsigned char volatile xdata *)0xfa58)
#define     DMA_UR3R_CR     (*(unsigned char volatile xdata *)0xfa59)
#define     DMA_UR3R_STA    (*(unsigned char volatile xdata *)0xfa5a)
#define     DMA_UR3R_AMT    (*(unsigned char volatile xdata *)0xfa5b)
#define     DMA_UR3R_DONE   (*(unsigned char volatile xdata *)0xfa5c)
#define     DMA_UR3R_RXA    (*(unsigned  int volatile xdata *)0xfa5d)
#define     DMA_UR3R_RXAH   (*(unsigned char volatile xdata *)0xfa5d)
#define     DMA_UR3R_RXAL   (*(unsigned char volatile xdata *)0xfa5e)

#define     DMA_UR4T_CFG    (*(unsigned char volatile xdata *)0xfa60)
#define     DMA_UR4T_CR     (*(unsigned char volatile xdata *)0xfa61)
#define     DMA_UR4T_STA    (*(unsigned char volatile xdata *)0xfa62)
#define     DMA_UR4T_AMT    (*(unsigned char volatile xdata *)0xfa63)
#define     DMA_UR4T_DONE   (*(unsigned char volatile xdata *)0xfa64)
#define     DMA_UR4T_TXA    (*(unsigned  int volatile xdata *)0xfa65)
#define     DMA_UR4T_TXAH   (*(unsigned char volatile xdata *)0xfa65)
#define     DMA_UR4T_TXAL   (*(unsigned char volatile xdata *)0xfa66)
#define     DMA_UR4R_CFG    (*(unsigned char volatile xdata *)0xfa68)
#define     DMA_UR4R_CR     (*(unsigned char volatile xdata *)0xfa69)
#define     DMA_UR4R_STA    (*(unsigned char volatile xdata *)0xfa6a)
#define     DMA_UR4R_AMT    (*(unsigned char volatile xdata *)0xfa6b)
#define     DMA_UR4R_DONE   (*(unsigned char volatile xdata *)0xfa6c)
#define     DMA_UR4R_RXA    (*(unsigned  int volatile xdata *)0xfa6d)
#define     DMA_UR4R_RXAH   (*(unsigned char volatile xdata *)0xfa6d)
#define     DMA_UR4R_RXAL   (*(unsigned char volatile xdata *)0xfa6e)

#define     DMA_LCM_CFG     (*(unsigned char volatile xdata *)0xfa70)
#define     DMA_LCM_CR      (*(unsigned char volatile xdata *)0xfa71)
#define     DMA_LCM_STA     (*(unsigned char volatile xdata *)0xfa72)
#define     DMA_LCM_AMT     (*(unsigned char volatile xdata *)0xfa73)
#define     DMA_LCM_DONE    (*(unsigned char volatile xdata *)0xfa74)
#define     DMA_LCM_TXA     (*(unsigned  int volatile xdata *)0xfa75)
#define     DMA_LCM_TXAH    (*(unsigned char volatile xdata *)0xfa75)
#define     DMA_LCM_TXAL    (*(unsigned char volatile xdata *)0xfa76)
#define     DMA_LCM_RXA     (*(unsigned  int volatile xdata *)0xfa77)
#define     DMA_LCM_RXAH    (*(unsigned char volatile xdata *)0xfa77)
#define     DMA_LCM_RXAL    (*(unsigned char volatile xdata *)0xfa78)

#endif